#include "Voice.h"
#include "MIDIHelper.h"
#include "LyricController.h"

using namespace std;

namespace SunnyDays {
    int channelVoice=1;
    void playVoice(int note, int velocity){
        PlayNote(hMidiOut, channelVoice, note, velocity);
    }
    void voice(){
        Sleep(13100);
        int sleep = 390;
        int wind[] =
                {
                        //故事的小黄花
                        -90,
                        300,M5,M5,M1,M1,_,M2,M3,_,
                        //从出生那年就飘着
                        -90,
                        M5,M5,M1,M1,0,M2,M3,300,M2,M1,_,
                        //童年的荡秋千
                        -90,
                        300,M5,M5,M1,M1,_,M2,M3,_,
                        //随记忆一直晃到现在
                        -90,
                        M3,_,500,M2,M3,M4,M3,M2,M4,M3,700,M2,700,_,

                        //Re so so si do si la So la
                        -90,
                        300,L5,M1,M1,M3,M4,M3,M2,700,M1,M2,
                        //si si si si la si la so
                        -90,
                        M3,M3,M3,M3,700,500,M2,M3,M2,700,M1,300,_,_,
                        //吹着前奏望着天空
                        -90,
                        300,L5,M1,M2,M3,M4,M3,M2,0,M1,
                        //我想起花瓣试着掉落
                        -90,
                        M2,300,M3,M3,M3,M3,0,M2,M3,0,M2,400,M1,_,

                        //为你翘课的那一天
                        -90,
                        0,L7,M1,M1,M1,M1,L7,700,M1,M1,400,
                        //花落的那一天
                        -90,
                        M1,M1,M1,L7,700,M1,M1,400,
                        //教室的那一间
                        -90,
                        M1,M1,M1,L7,700,M1,M1,400,
                        //我怎么看不见
                        -90,
                        M1,M1,M1,M5,700,M5,M5,400,
                        //消失的下雨天
                        -90,
                        0,M5,M5,M5,M5,700,M5,M5,400,
                        //我好想再淋一遍
                        -90,
                        0,M5,M5,M5,700,300,M5,700,M4,M3,M3,500,300,_,_,

                        //没想到失去的勇气我还留着
                        -90,
                        0,M1,M1,M1,M1,L6,_,300,L7,M1,M5,M4,M3,M1,M1,_,_,
                        //好想再问一遍
                        -90,
                        0,M1,M1,M1,M1,400,300,M3,M1,_,_,
                        //你会等待还是离开
                        -90,
                        L6,L7,M1,M5,M4,M3,M1,M2,_,_,_,_,_,

                        //进入副歌计时 和弦启奏
                        -30,
                        //刮风这天 我试过握着你手
                        -90,
                        300,M3,M2,M4,M3,_,
                        M1,M5,M7,H2,H1,M5,M1,_,
                        //但偏偏 雨渐渐
                        -90,
                        M1,M6,M6,_,M6,M5,M5,_,
                        //大到我看你不见
                        -90,
                        M5,M4,M3,M2,M3,M4,M3,_,_,

                        //还有多久 我才能在你身边
                        -90,
                        300,M3,M4,M5,M3,_,M4,M5,M7,H2,M7,H1,H1,_,_,_,
                        //等到放晴的那天 也许我会比较好一点
                        -90,
                        300,H1,H1,M5,M5,M6,M5,M4,
                        M2,M3,M4,M5,M6,M1,M6,400,0,M7,M7,_,400,

                        //从前从前 有个人爱你很久
                        -90,
                        300,M3,M2,M4,M3,_,
                        M1,M5,M7,H1,M7,M5,M1,_,
                        //但偏偏 风渐渐 把距离吹得好远
                        -90,
                        M1,M6,M6,_,M6,M5,M5,_,
                        M5,M4,M3,M2,M3,M4,M3,_,_,
                        //好不容易 又能再多爱一天
                        -90,
                        300,M3,M4,M5,M3,_,
                        M4,M5,M7,H2,M7,H1,H1,_,_,_,
                        //但故事的最后你好像还是说了 拜拜
                        -90,
                        300,H1,H1,M5,M5,M6,M5,M4,L6,L7,M1,M2,M3,M2,_,_,
                        300,M3,_,M1,_,_,_,

                        _,_,_,_, _,_,_,_,

                        -30,
                        //为你翘课的那一天
                        -90,
                        0,L7,M1,M1,M1,M1,L7,700,M1,M1,400,
                        //花落的那一天
                        -90,
                        M1,M1,M1,L7,700,M1,M1,400,
                        //教室的那一间
                        -90,
                        M1,M1,M1,L7,700,M1,M1,400,
                        //我怎么看不见
                        -90,
                        M1,M1,M1,M5,700,M5,M5,400,
                        //消失的下雨天
                        -90,
                        0,M5,M5,M5,M5,700,M5,M5,400,
                        //我好想再淋一遍
                        -90,
                        0,M5,M5,M5,700,300,M5,700,M4,M3,M3,500,300,_,_,

                        //没想到失去的勇气我还留着
                        -90,
                        0,M1,M1,M1,M1,L6,_,300,L7,M1,M5,M4,M3,M1,M1,_,_,
                        //好想再问一遍
                        -90,
                        0,M1,M1,M1,M1,400,300,M3,M1,_,_,
                        //你会等待还是离开
                        -90,
                        L6,L7,M1,M5,M4,M3,M1,M2,_,_,_,_,_,

                        -30,
                        //从前从前 有个人爱你很久↑
                        -90,
                        300,M3,M2,M4,M3,_,
                        M1,M5,M7,H1,M7,H2,H1,_,_,
                        //偏偏 风渐渐 把距离吹得好远
                        -90,
                        M7,M6,_,M6,M5,M5,_,
                        M5,M4,M3,M2,M3,M4,M3,_,_,_,

                        //好不容易 又能再多爱一天
                        -90,
                        300,M3,M4,M5,M3,_,M4,M5,M7,H2,M7,H1,H1,_,_,
                        //但故事的最后你好像还是说了 拜拜
                        -90,
                        300,H1,H1,M5,M5,M6,M5,M4,L6,L7,M1,M2,M3,M2,_,_,
                        300,M3,_,M1,_,_,_,
                };
        for (auto i : wind) {
            if(i==-30){logTime("Enter chorus");continue;}
            if(i==-90){NextLyric(); continue;}
            if (i == 0) { sleep = 180; continue; }
            if (i == 700) { Sleep(175); continue; }
            if(i==400) { Sleep(225); continue; }
            if(i==500){sleep=200; continue;}
            if (i == 300) { sleep = 390; continue; }
            if (i == _) {
                Sleep(390);
                continue;
            }
            playVoice(i, 80);
            Sleep(sleep);
        }
    }
}